Dlubal.RFEM5.ILoads
Interface for working with loads

Dlubal.RFEM5.ILoads.PrepareModification
Prepares modification.

Dlubal.RFEM5.ILoads.FinishModification
Finishes modification.

Dlubal.RFEM5.ILoads.CancelModification
Cancels current data modification.

Dlubal.RFEM5.ILoads.HasAnyResults
Indicates if the model has any results.
Returns: True if the model has any results, otherwise false.

Dlubal.RFEM5.ILoads.HasAnyLoadingResults(System.UInt32)
Indicates if at least one load of the specified loading type has any results.
Returns: True if the specified load type has any results, otherwise false.
Type: Type of model object.

Dlubal.RFEM5.ILoads.HasLoadingResults(System.UInt32)
Indicates if at least one load of the specified loading type has any results.
Returns: True if the specified load has any results, otherwise false.
Loading: Load type and number.

Dlubal.RFEM5.ILoads.Clean
Deletes all loadings.

Dlubal.RFEM5.ILoads.DeleteLoading(System.UInt32,System.String)
Deletes specified loadings.
Type: Type of loading objects.
List: List of loading No. to delete. E.g.: "1,2,3"; "1-5"; "1-3,5"; "all"

Dlubal.RFEM5.ILoads.GetLastObjectNo(System.UInt32)
Gets number of last loading object.
Returns: No. of last object.
Type: Type of model object.

Dlubal.RFEM5.ILoads.GetLoadCaseCount
Gets count of load cases.
Returns: Count of load cases in the model.

Dlubal.RFEM5.ILoads.GetLoadCase(System.Int32,System.UInt32)
Gets interface for working with load case.
Returns: Load case interface.
No: No. or index of the load case you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoads.SetLoadCase(System.UInt32@)
Sets load case and returns it's interface.
Returns: Load case interface.
Load: Load case parameters.

Dlubal.RFEM5.ILoads.GetLoadCases
Gets array of load cases.
Returns: Array of load cases.

Dlubal.RFEM5.ILoads.SetLoadCases(System.UInt32@)
Sets array of load cases.
Loads: Array of load cases to be set.

Dlubal.RFEM5.ILoads.GetLoadCombinationCount
Gets count of load combinations.
Returns: Count of load combinations in the model.

Dlubal.RFEM5.ILoads.GetLoadCombination(System.Int32,System.UInt32)
Gets interface for working with load combination.
Returns: Load combination interface.
No: No. or index of the load combination you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoads.SetLoadCombination(System.UInt32@)
Sets load combination and returns it's interface.
Returns: Load combination interface.
Load: Load combination parameters.

Dlubal.RFEM5.ILoads.GetLoadCombinations
Gets array of load combinations.
Returns: Array of load combinations.

Dlubal.RFEM5.ILoads.SetLoadCombinations(System.UInt32@)
Sets array of load combinations.
Loads: Array of load combinations to be set.

Dlubal.RFEM5.ILoads.GetResultCombinationCount
Gets count of result combinations.
Returns: Count of result combinations in the model.

Dlubal.RFEM5.ILoads.GetResultCombination(System.Int32,System.UInt32)
Gets to result combination interface.
Returns: Result combination interface.
No: No. or index of the result combination you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoads.SetResultCombination(System.UInt32@)
Sets result combination and returns it's interface.
Returns: Result combination interface.
Load: Result combination parameters.

Dlubal.RFEM5.ILoads.GetResultCombinations
Gets array of result combinations.
Returns: Array of result combinations.

Dlubal.RFEM5.ILoads.SetResultCombinations(System.UInt32@)
Sets array of result combinations.
Loads: Array of result combinations to be set.

Dlubal.RFEM5.ILoads.GetSuperCombinationCount
Gets count of super combinations.
Returns: Count of super combinations in the model.

Dlubal.RFEM5.ILoads.GetSuperCombination(System.Int32,System.UInt32)
Gets to super combination interface.
Returns: Super combination interface.
No: No. or index of the super combination you want to get.
At: Specifies the type of access.

Dlubal.RFEM5.ILoads.SetSuperCombination(System.UInt32@)
Sets super combination and returns it's interface.
Returns: Super combination interface.
Load: Super combination parameters.

Dlubal.RFEM5.ILoads.GetSuperCombinations
Gets array of super combinations.
Returns: Array of super combinations.

Dlubal.RFEM5.ILoads.SetSuperCombinations(System.UInt32@)
Sets array of super combinations.
Loads: Array of super combinations to be set.

Dlubal.RFEM5.ILoads.GenerateAreaLoad(System.UInt32@)
Generates member loads from an area load of plane.
Area: Area load parameters.